apache/nuttx/arch/arm/src/stm32l4/stm32l4_qspi.c
      if (priv->ntimes > 0)
        {
          /* Yes... show how many times we did it */

          spiinfo("...[Repeats %d times]...\n", priv->ntimes);
        }

      /* Save information about the new access */

      priv->wrlast      = wr;
      priv->valuelast   = value;
      priv->addresslast = address;
      priv->ntimes      = 0;
    }

  /* Return true if this is the first time that we have done this operation */

  return true;
}
#endif

/****************************************************************************
 * Name: qspi_getreg
 *
 * Description:
 *  Read an QSPI register
 *
 ****************************************************************************/

static inline uint32_t qspi_getreg(struct stm32_qspidev_s *priv,
                                  unsigned int offset)
{
  uint32_t address = priv->base + offset;
  uint32_t value = getreg32(address);

#ifdef CONFIG_STM32L4_QSPI_REGDEBUG
  if (qspi_checkreg(priv, false, value, address))
    {
      spiinfo("%08" PRIx32 "->%08" PRIx32 "\n", address, value);
    }
#endif

  return value;
}

/****************************************************************************
 * Name: qspi_putreg
 *
 * Description:
 *  Write a value to an QSPI register
 *
 ****************************************************************************/

static inline void qspi_putreg(struct stm32_qspidev_s *priv,
                               uint32_t value, unsigned int offset)
{
  uint32_t address = priv->base + offset;

#ifdef CONFIG_STM32L4_QSPI_REGDEBUG
  if (qspi_checkreg(priv, true, value, address))
    {
      spiinfo("%08" PRIx32 "<-%08" PRIx32 "\n", address, value);
    }
#endif

  putreg32(value, address);
}

/****************************************************************************
 * Name: qspi_dumpregs
 *
 * Description:
 *   Dump the contents of all QSPI registers
 *
 * Input Parameters:
 *   priv - The QSPI controller to dump
 *   msg - Message to print before the register data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_SPI_INFO
static void qspi_dumpregs(struct stm32_qspidev_s *priv, const char *msg)
{
  uint32_t regval;
  spiinfo("%s:\n", msg);

#if 0
  /* This extra verbose output may be helpful in some cases; you'll need
   * to make sure your syslog is large enough to accommodate the extra
   * output.
   */

  regval = getreg32(priv->base + STM32_QUADSPI_CR_OFFSET);    /* Control Register */
  spiinfo("CR:%08" PRIx32 "\n", regval);
  spiinfo("  EN:%1d ABORT:%1d DMAEN:%1d TCEN:%1d SSHIFT:%1d\n"
          "  FTHRES: %d\n"
          "  TEIE:%1d TCIE:%1d FTIE:%1d SMIE:%1d TOIE:%1d APMS:%1d PMM:%1d\n"
          "  PRESCALER: %d\n",
          (regval & QSPI_CR_EN) ? 1 : 0,
          (regval & QSPI_CR_ABORT) ? 1 : 0,
          (regval & QSPI_CR_DMAEN) ? 1 : 0,
          (regval & QSPI_CR_TCEN) ? 1 : 0,
          (regval & QSPI_CR_SSHIFT) ? 1 : 0,
          (regval & QSPI_CR_FTHRES_MASK) >> QSPI_CR_FTHRES_SHIFT,
          (regval & QSPI_CR_TEIE) ? 1 : 0,
          (regval & QSPI_CR_TCIE) ? 1 : 0,
          (regval & QSPI_CR_FTIE) ? 1 : 0,
          (regval & QSPI_CR_SMIE) ? 1 : 0,
          (regval & QSPI_CR_TOIE) ? 1 : 0,
          (regval & QSPI_CR_APMS) ? 1 : 0,
          (regval & QSPI_CR_PMM) ? 1 : 0,
          (regval & QSPI_CR_PRESCALER_MASK) >> QSPI_CR_PRESCALER_SHIFT);

  regval = getreg32(priv->base + STM32_QUADSPI_DCR_OFFSET);   /* Device Configuration Register */
  spiinfo("DCR:%08" PRIx32 "\n", regval);
  spiinfo("  CKMODE:%1d CSHT:%d FSIZE:%d\n",
          (regval & QSPI_DCR_CKMODE) ? 1 : 0,
          (regval & QSPI_DCR_CSHT_MASK) >> QSPI_DCR_CSHT_SHIFT,
          (regval & QSPI_DCR_FSIZE_MASK) >> QSPI_DCR_FSIZE_SHIFT);

  regval = getreg32(priv->base + STM32_QUADSPI_CCR_OFFSET);   /* Communication Configuration Register */
  spiinfo("CCR:%08" PRIx32 "\n", regval);
  spiinfo("   INST:%02x IMODE:%d ADMODE:%d ADSIZE:%d ABMODE:%d\n"
          "   ABSIZE:%d DCYC:%d DMODE:%d FMODE:%d\n"
          "   SIOO:%1d DDRM:%1d\n",
          (regval & QSPI_CCR_INSTRUCTION_MASK) >> QSPI_CCR_INSTRUCTION_SHIFT,
          (regval & QSPI_CCR_IMODE_MASK) >> QSPI_CCR_IMODE_SHIFT,
          (regval & QSPI_CCR_ADMODE_MASK) >> QSPI_CCR_ADMODE_SHIFT,
          (regval & QSPI_CCR_ADSIZE_MASK) >> QSPI_CCR_ABSIZE_SHIFT,
          (regval & QSPI_CCR_ABMODE_MASK) >> QSPI_CCR_ABMODE_SHIFT,
          (regval & QSPI_CCR_ABSIZE_MASK) >> QSPI_CCR_ABSIZE_SHIFT,
          (regval & QSPI_CCR_DCYC_MASK) >> QSPI_CCR_DCYC_SHIFT,
          (regval & QSPI_CCR_DMODE_MASK) >> QSPI_CCR_DMODE_SHIFT,
          (regval & QSPI_CCR_FMODE_MASK) >> QSPI_CCR_FMODE_SHIFT,
          (regval & QSPI_CCR_SIOO) ? 1 : 0,
          (regval & QSPI_CCR_DDRM) ? 1 : 0);

  regval = getreg32(priv->base + STM32_QUADSPI_SR_OFFSET);    /* Status Register */
  spiinfo("SR:%08" PRIx32 "\n", regval);
  spiinfo("  TEF:%1d TCF:%1d FTF:%1d SMF:%1d TOF:%1d BUSY:%1d FLEVEL:%d\n",
          (regval & QSPI_SR_TEF) ? 1 : 0,
          (regval & QSPI_SR_TCF) ? 1 : 0,
          (regval & QSPI_SR_FTF) ? 1 : 0,
          (regval & QSPI_SR_SMF) ? 1 : 0,
          (regval & QSPI_SR_TOF) ? 1 : 0,
          (regval & QSPI_SR_BUSY) ? 1 : 0,
          (regval & QSPI_SR_FLEVEL_MASK) >> QSPI_SR_FLEVEL_SHIFT);

#else
  spiinfo("    CR:%08" PRIx32 "   DCR:%08" PRIx32
          "   CCR:%08" PRIx32 "    SR:%08" PRIx32 "\n",
          getreg32(priv->base + STM32_QUADSPI_CR_OFFSET),     /* Control Register */
          getreg32(priv->base + STM32_QUADSPI_DCR_OFFSET),    /* Device Configuration Register */
          getreg32(priv->base + STM32_QUADSPI_CCR_OFFSET),    /* Communication Configuration Register */
          getreg32(priv->base + STM32_QUADSPI_SR_OFFSET));    /* Status Register */
  spiinfo("   DLR:%08" PRIx32 "   ABR:%08" PRIx32
          " PSMKR:%08" PRIx32 " PSMAR:%08" PRIx32 "\n",
          getreg32(priv->base + STM32_QUADSPI_DLR_OFFSET),    /* Data Length Register */
          getreg32(priv->base + STM32_QUADSPI_ABR_OFFSET),    /* Alternate Bytes Register */
          getreg32(priv->base + STM32_QUADSPI_PSMKR_OFFSET),  /* Polling Status mask Register */
          getreg32(priv->base + STM32_QUADSPI_PSMAR_OFFSET)); /* Polling Status match Register */
  spiinfo("   PIR:%08" PRIx32 "  LPTR:%08" PRIx32 "\n",
          getreg32(priv->base + STM32_QUADSPI_PIR_OFFSET),    /* Polling Interval Register */
          getreg32(priv->base + STM32_QUADSPI_LPTR_OFFSET));  /* Low-Power Timeout Register */
  UNUSED(regval);
#endif
}
#endif

#if defined(CONFIG_DEBUG_SPI_INFO) && defined(CONFIG_DEBUG_GPIO)
static void qspi_dumpgpioconfig(const char *msg)
{
  uint32_t regval;
  spiinfo("%s:\n", msg);

  regval = getreg32(STM32_GPIOE_MODER);
  spiinfo("E_MODER:%08" PRIx32 "\n", regval);

